import datetime

fridays_before_public_holidays_2023 = [datetime.date(2023, 4, 28), datetime.date(2023, 5, 5), datetime.date(2023, 6, 9), datetime.date(2023, 11, 3)]
first_working_day_after_holidays_2023 = [datetime.date(2023, 5, 2), datetime.date(2023, 6, 13), datetime.date(2023, 11, 7)]
deparments = ['7', '70', '77', '771', '772', '7А', '7А1', '70А', '705', '706', '71', '72', '73', '733', '734', '737', '762', '78', '791', '075']
departents_and_leads = {'7': 'Нуралиев Сергей',
                        '70': 'Нуралиев Сергей',
                        '77': 'Нуралиев Сергей',
                        '771': 'Армен Асатрян',
                        '772': 'Чичерин Андрей',
                        '7А': 'Бобров Федор',
                        '7А1': 'Косилов Никита',
                        '70А': 'Шустерняк Дмитрий',
                        '705': 'Дарвиш Басель',
                        '706': 'Старичков Никита',
                        '71': 'Плотников Александр',
                        '72': 'Филиппов Виталий',
                        '73': 'Моничев Алексей',
                        '733': 'Кислов Алексей',
                        '734': 'Молоканова Валерия',
                        '737': 'Посашков Александр',
                        '752': 'Евтушенко Антон',
                        '78': 'Митрохин Станислав',
                        '791': 'Шагизиганов Артем',
                        '075': 'Новиков Алексей'}
lead_preferences = {'Нуралиев Сергей': ['after', 'no'],
                    'Армен Асатрян': ['before', 'yes'],
                    'Чичерин Андрей': ['dk', 'dk'],
                    'Бобров Федор': ['before', 'yes'],
                    'Косилов Никита': ['dk', 'dk'],
                    'Шустерняк Дмитрий': ['before', 'yes'],
                    'Дарвиш Басель': ['after', 'yes'],
                    'Буланкин Данил': ['before', 'yes'],
                    'Старичков Никита': ['before', 'yes'],
                    'Плотников Александр': ['before', 'yes'],
                    'Филиппов Виталий': ['before', 'no'],
                    'Моничев Алексей': ['before', 'no'],
                    'Кислов Алексей': ['before', 'yes'],
                    'Молоканова Валерия': ['before', 'no'],
                    'Посашков Александр': ['after', 'no'],
                    'Евтушенко Антон': ['before', 'no'],
                    'Митрохин Станислав': ['after', 'yes'],
                    'Шагизиганов Артем': ['before', 'yes'],
                    'Новиков Алексей': ['dk', 'dk'],
                    'Алейников Роман': ['before', 'yes'],
                    'Дмитриев Владислав': ['before', 'yes'],
                    'Нуралиев Антон': ['before', 'yes'],
                    'Дамье Геннадий':['before', 'yes'],
                    'Дерут Одей': ['before', 'no'],
                    'Лакутин Алексей': ['before', 'yes'],
                    'Лейбович Максим': ['before', 'yes'],
                    'Орлов Алексей': ['before', 'yes'],
                    'Силин Евгений': ['dk', 'dk']}
Alenikov_team = ['Агеев Александр','Афанасьев Дмитрий','Благовещенский Сергей','Караблин Александр','Старикова Ирина','Захаров Илья',
                 'Зенин Павел','Ядренников Александр','Стрижак Татьяна','Зорий Александр','Харчук Павел','Усевич Алексей','Яунжекарс Владимир',
                 'Нырков Максим','Бобровников Алексей','Селеменев Андрей','Чулинин Юрий','Моросин Олег','Апресов Игорь','Родин Александр',
                 'Овчинников Вадим','Гладков Алексей','Полонская Диана','Твердов Константин','Шкандыбин Юрий','Егоров Михаил','Скрынников Никита']

Dmitriev_team = ['Михайлов Кирилл', 'Александр Пашнин', 'Лев Сушанек', 'Сергей Винокуров', 'Сергей Михайлов', 'Сергей Корякин',
                 'Петриков Евгений', 'Владислав Дмитриев', 'Денис Деревянкин', 'Федин Дмитрий', 'Матушкин Сергей',
                 'Кондрашов Кирилл', 'Зуев Степан','Чугунов Дмитрий', 'Гусаров Игорь', 'Черепанов Роман']

Nuraliev_team = ['Забелинский Андрей','Капцан Арсентий','Полежаев Денис','Левин Евгений','Сосновский Роман','Королев Евгений',
                 'Чистяков Евгений']

Damie_team = ['Соляник Александр']

Derut_team = ['Звягинцев Денис', 'Козлов Александр', 'Родионов Виталий', 'Кузнецов Юрий']

Lakutin_team = ['Шуран Дмитрий','Романов Павел','Чернов Вадим','Звездин Никита','Шерстобитов Евгений']

Lebovich_team = ['Волков Андрей','Куприянов Владислав','Лехан Александр','Межуев Даниил','Мельников Сергей','Редько Александр',
                 'Топорков Артем','Тюшкин Андрей','Черемисинов Василий']

birthdays_not_in_1C_table2023 = {datetime.date(2023, 6, 13): ['Смирнов Евгений', 'Нуралиев Антон']}