import datetime
from enum import Enum


class TimePreference(Enum):
    unknown = 0
    before = 1
    after = 2

fridays_before_public_holidays_2023 = [datetime.date(2023, 4, 28), datetime.date(2023, 5, 5), datetime.date(2023, 6, 9),
                                       datetime.date(2023, 11, 3)]
first_working_day_after_holidays_2023 = [datetime.date(2023, 5, 2), datetime.date(2023, 6, 13),
                                         datetime.date(2023, 11, 7)]
departments = ['7', '70', '77', '771', '7А', '7А1', '70А', '705', '706', '707', '71', '72', '73', '733', '734', '737',
               '762', '78', '791', '792', '793', '075']

departments_and_leads = {'7': 'Нуралиев Сергей',
                         '70': 'Нуралиев Сергей',
                         '77': 'Нуралиев Сергей',
                         '771': 'Армен Асатрян',
                         '7А': 'Бобров Федор',
                         '7А1': 'Косилов Никита',
                         '70А': 'Шустерняк Дмитрий',
                         '705': 'Дарвиш Басель',
                         '706': 'Старичков Никита',
                         '71': 'Плотников Александр',
                         '72': 'Филиппов Виталий',
                         '73': 'Моничев Алексей',
                         '733': 'Кислов Алексей',
                         '734': 'Молоканова Валерия',
                         '737': 'Посашков Александр',
                         '762': 'Шафорост Филипп',
                         '752': 'Евтушенко Антон',
                         '78': 'Митрохин Станислав',
                         '791': 'Шагизиганов Артем',
                         '792': 'Кузькин Дмитрий',
                         '793': 'Митрофанова Ирина',
                         '075': 'Новиков Алексей'}
departments_with_several_people_to_notify = {'705': ['Буланкин Данил']}
lead_preferences = {'Нуралиев Сергей': [TimePreference.after, False],
                    'Армен Асатрян': [TimePreference.before, True],
                    'Бобров Федор': [TimePreference.before, True],
                    'Косилов Никита': [TimePreference.before, True],
                    'Шустерняк Дмитрий': [TimePreference.before, True],
                    'Дарвиш Басель': [TimePreference.after, True],
                    'Буланкин Данил': [TimePreference.before, True],
                    'Старичков Никита': [TimePreference.before, True],
                    'Плотников Александр': [TimePreference.before, True],
                    'Филиппов Виталий': [TimePreference.before, False],
                    'Моничев Алексей': [TimePreference.before, False],
                    'Кислов Алексей': [TimePreference.before, True],
                    'Молоканова Валерия': [TimePreference.before, False],
                    'Посашков Александр': [TimePreference.after, False],
                    'Митрохин Станислав': [TimePreference.after, True],
                    'Шагизиганов Артем': [TimePreference.before, True],
                    'Новиков Алексей': [TimePreference.unknown, 'dk'],
                    'Алейников Роман': [TimePreference.before, True],
                    'Дмитриев Владислав': [TimePreference.before, True],
                    'Нуралиев Антон': [TimePreference.before, True],
                    'Дамье Геннадий': [TimePreference.before, True],
                    'Дерут Одей': [TimePreference.before, False],
                    'Лакутин Алексей': [TimePreference.before, True],
                    'Лейбович Максим': [TimePreference.before, True],
                    'Орлов Алексей': [TimePreference.before, True],
                    # 'Силин Евгений': [TimePreference.unknown, 'dk'], - отказался 13.06
                    'Кузькин Дмитрий': [TimePreference.before, True],
                    'Митрофанова Ирина': [TimePreference.before, True]}
# 1
Alenikov_team = [
    ['Агеев Александр', 'Афанасьев Дмитрий', 'Благовещенский Сергей', 'Караблин Александр', 'Старикова Ирина',
     'Захаров Илья',
     'Зенин Павел', 'Ядренников Александр', 'Стрижак Татьяна', 'Зорий Александр', 'Харчук Павел', 'Усевич Алексей',
     'Яунжекарс Владимир',
     'Нырков Максим', 'Бобровников Алексей', 'Селеменев Андрей', 'Чулинин Юрий', 'Моросин Олег', 'Апресов Игорь',
     'Родин Александр',
     'Овчинников Вадим', 'Гладков Алексей', 'Полонская Диана', 'Твердов Константин', 'Шкандыбин Юрий', 'Егоров Михаил',
     'Скрынников Никита',
     'Щербаков Никита'], ['Алейников Роман']]
# 2
Dmitriev_team = [
    ['Михайлов Кирилл', 'Александр Пашнин', 'Лев Сушанек', 'Сергей Винокуров', 'Сергей Михайлов', 'Сергей Корякин',
     'Петриков Евгений', 'Владислав Дмитриев', 'Денис Деревянкин', 'Федин Дмитрий', 'Матушкин Сергей',
     'Кондрашов Кирилл', 'Зуев Степан', 'Чугунов Дмитрий', 'Гусаров Игорь', 'Черепанов Роман'], ['Дмитриев Владислав']]

# 1
Nuraliev_team = [
    ['Забелинский Андрей', 'Капцан Арсентий', 'Полежаев Денис', 'Левин Евгений', 'Сосновский Роман', 'Королев Евгений',
     'Чистяков Евгений'], ['Нуралиев Антон']]
# 2
Damie_team = [['Соляник Александр'], ['Дамье Геннадий']]
# 3
Derut_team = [['Звягинцев Денис', 'Козлов Александр', 'Родионов Виталий', 'Кузнецов Юрий'], ['Дерут Одей']]
# 4
Lakutin_team = [['Шуран Дмитрий', 'Романов Павел', 'Чернов Вадим', 'Звездин Никита', 'Шерстобитов Евгений'],
                ['Лакутин Алексей']]
# 5
Lebovich_team = [
    ['Волков Андрей', 'Куприянов Владислав', 'Лехан Александр', 'Межуев Даниил', 'Мельников Сергей', 'Редько Александр',
     'Топорков Артем', 'Тюшкин Андрей', 'Черемисинов Василий'], ['Лейбович Максим']]
# 6
Orlov_team = [
    ['Ахметзянов Талгат', 'Воробьев Алексей', 'Коваленко Игорь', 'Малачиев Шапи', 'Овсянкин Андрей', 'Тырва Алексей',
     'Федечкин Сергей', 'Щербаков Степан'], ['Орлов Алексей']]
# 9
Silin_team = [['Трубкин Александр', 'Левшин Николай', 'Швецов Илья', 'Беляев Максим', 'Ишханян Семен', 'Мурзин Сергей',
               'Леньков Сергей'], ['Силин Евгений']]

departments_with_teams = {'70': [Alenikov_team, Dmitriev_team],
                          '77': [Nuraliev_team, Damie_team, Derut_team, Lakutin_team, Lebovich_team, Orlov_team, Silin_team]}
student_group = '707'
students_705 = [['Гаврилов Александр', 'Баусов Вадим', 'Павленко Иван'], ['Дарвиш Басель', 'Буланкин Данил']]
students_792 = [['Круглова Елизавета', 'Шитро Алексей'], ['Кузькин Дмитрий']]
students_Silin = [['Пятковский Кирилл'], ['Силин Евгений']]

teams_with_students = [students_705, students_792]

birthdays_not_in_1C_table2023 = {datetime.date(2023, 6, 13): ['Смирнов Евгений', 'Нуралиев Антон']}
